Feature: Нанасяне на оценка
  
Background:
Given: Учителят отваря екрана за нанасяне на оценка по даден предмет

  Scenario: Нанасяне на оценка от учител по даденият предмет
    Given учителят по предмета отваря екрана за нанасяне на оценка по предмета
    And Въведе потребителското си име
    And Въведе предмет, по който ще сложи оценка
    When Въведе 4 като оценка
    And натисне бутона за запазване на оценката
    Then вижда "Записването е успешно"
    
    Scenario: Нанасяне на оценка от учител от друг предмет
    Given учителят по предмета отваря екрана за нанасяне на оценка по предмета
    And Въведе грешно потребителското си име
    And Въведе предмет, по който ще сложи оценка
    When Въведе 4 като оценка
    And натисне бутона за запазване на оценката
    Then вижда "Преподавателят не може да въвежда оценки по този предмет!"
    
    Scenario: Нанасяне на оценка от учител по несъществуващ предмет
    Given учителят по предмета отваря екрана за нанасяне на оценка по предмета
    And Въведе потребителското си име
    And Въведе грешен предмет, по който ще сложи оценка
    When Въведе 4 като оценка
    And натисне бутона за запазване на оценката
    Then вижда "Not a valid subject!"
    
    
    Scenario: Нанасяне на оценка по-ниска от 2 от учител по съществуващ предмет
    Given учителят по предмета отваря екрана за нанасяне на оценка по предмета
    And Въведе потребителското си име
    And Въведе предмет, по който ще сложи оценка
    When Въведе 1 като оценка
    And натисне бутона за запазване на оценката
    Then вижда "Oценката не може да е по-малко от 2!"
    
    
     Scenario: Нанасяне на оценка по-висока от 6 от учител по съществуващ предмет
    Given учителят по предмета отваря екрана за нанасяне на оценка по предмета
    And Въведе потребителското си име
    And Въведе предмет, по който ще сложи оценка
    When Въведе 7 като оценка
    And натисне бутона за запазване на оценката
    Then вижда "Оценката не може да е по-голяма от 6!"